---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.ExternalService
source: html/08c2958a-2149-88e2-cf3e-d1cee9ce3807.htm
---
# ExternalService Methods

Registers a server with its service.